[{
  "Alabama": [
    "Bear wrestling matches are prohibited.",
    "Incestuous marriages are legal.",
    "It is illegal to impersonate a person of the clergy.",
    "It is illegal to maim oneself to escape duty.",
    "You must have windshield wipers on your car.",
    "You may not have an ice cream cone in your back pocket at any time.",
    "Masks may not be worn in public.",
    "It is considered an offense to open an umbrella on a street, for fear of spooking horses.",
    "Women are able to retain all property they owned prior to marriage in the case of divorce. However, this provision does not apply to men.",
    "It is illegal to sell peanuts in Lee County after sundown on Wednesday.",
    "It is illegal for a driver to be blindfolded while operating a vehicle.",
    "Dominoes may not be played on Sunday.",
    "It is illegal to wear a fake moustache that causes laughter in church.",
    "Putting salt on a railroad track may be punishable by death.",
    "Boogers may not be flicked into the wind.",
    "It is legal to drive the wrong way down a one-way street if you have a lantern attached to the front of your automobile.",
    "You may not wear blue jeans down Noble Street.",
    "No person may spit on the floor of a church.",
    "It is illegal to bike, roller-skate, skateboard, or inline skate in a commercially zoned area.",
    "Men who deflower virgins, regardless of age or marital status, may face up to five years in jail."
  ]
},{
  "Alaska": [
    "Moose may not be viewed from an airplane.",
    "While it is legal to shoot bears, waking a sleeping bear for the purpose of taking a photograph is prohibited.",
    "It is considered an offense to push a live moose out of a moving airplane.",
    "No one may tie their pet dog to the roof of a car.",
    "For all you would-be pranksters out there, it is illegal to string a wire across any road.",
    "Persons may not live in a trailer as it is being hauled across the city.",
    "Clowns beware!",
    "It is considered an offense to feed alcoholic beverages to a moose.",
    "A person may only carry a concealed slingshot if that person has received the appropriate license.",
    "It is against the law to attempt to break any law in title 9 of the code (public peace, morals, and welfare).",
    "Employers of bars may not let their bartenders serve while they are drunk themselves.",
    "Owners of flamingos may not let their pet into barber shops.",
    "Buildings that preserve scenic vistas are awarded ?bonus points? by the government.",
    "One may not roam the city with a bow and arrows.",
    "Persons may not allow “attractive nuisances” to exist."
  ]
},{
  "Arizona": [
    "Hunting camels is prohibited.",
    "Any misdemeanor committed while wearing a red mask is considered a felony.",
    "There is a possible 25 years in prison for cutting down a cactus.",
    "Donkeys cannot sleep in bathtubs.",
    "A class 2 misdemeanor occurs if one places a mark upon a flag which is “likely to provoke physical retaliation”.",
    "It is illegal to manufacture imitation cocaine.",
    "When being attacked by a criminal or burglar, you may only protect yourself with the same weapon that the other person posseses.",
    "It is unlawful to refuse a person a glass of water.",
    "You may not have more than two dildos in a house.",
    "Cards may not be played in the street with a Native American.",
    "If you bother the cottontails or bullfrogs, you will be fined.",
    "No more than six girls may live in any house.",
    "It is illegal to smoke cigarettes within 15 feet of a public place unless you have a Class 12 liqueur license.",
    "A decree declares that anyone caught stealing soap must wash himself with it until it is all used up.",
    "An ordinance prohibits the wearing of suspenders.",
    "No one is permitted to ride their horse up the stairs of the county court house.",
    "One must be 18 years old to buy spray paint.",
    "It is illegal for men and women over the age of 18 to have less than one missing tooth visible when smiling.",
    "Women may not wear pants."
  ]
},{
  "Arkansas": [
    "It’s strictly prohibited to pronounce “Arkansas” incorrectly",
    "The Arkansas River can rise no higher than to the Main Street bridge in Little Rock.",
    "A law provides that school teachers who bob their hair will not get a raise.",
    "A man can legally beat his wife, but not more than once a month.",
    "Oral sex is considered to be sodomy.",
    "Alligators may not be kept in bathtubs.",
    "It is illegal to kill “any living creature”.",
    "Honking oneâ??s car horn at a sandwich shop after 9 PM is against the law.",
    "No one may â??suddenly start or stopâ?? their car at a McDonaldâ??s.",
    "Dogs may not bark after 6 PM.",
    "Flirtation between men and women on the streets of Little Rock may result in a 30-day jail term.",
    "It is unlawful to walk one’s cow down Main Street after 1:00 PM on Sunday."
  ]
},{
  "California": [
    "California prison workers will no longer be allowed to have sex with inmates",
    "Film producers must have permission from a pediatrician before filming a child under the age of one month",
    "It’s unlawful to let a dog pursue a bear or bobcat at any time.",
    "In San Jose and Sunnyvale it is illegal for grocery stores to provide plastic bags.",
    "You may only throw a frisbee at the beach in Los Angeles County, CA with the lifeguard’s permission.",
    "Sunshine is guaranteed to the masses.",
    "It is a misdemeanor to shoot at any kind of game from a moving vehicle, unless the target is a whale.",
    "Women may not drive in a house coat.",
    "No vehicle without a driver may exceed 60 miles per hour.",
    "Animals are banned from mating publicly within 1,500 feet of a tavern, school, or place of worship.",
    "Bathhouses are against the law.",
    "You cannot leave your car on the street overnight without the proper permit.",
    "Peacocks have the right of way to cross any street, including driveways.",
    "Nobody is allowed to ride a bicycle in a swimming pool.",
    "City Council order reads: “No dog shall be in a public place without its master on a leash.",
    "You are not permitted to wear cowboy boots unless you already own at least two cows.",
    "It is illegal to spit, except on baseball diamonds.",
    "A man can’t go outside while wearing a jacket and pants that do not match.",
    "Ice cream may not be eaten while standing on the sidewalk. (Repealed when Clint Eastwood was mayor)",
    "Women may not wear high heels while in the city limits."
  ]
},{
  "Colorado": [
    "One may not mutilate a rock in a state park.",
    "Car dealers may not show cars on a Sunday.",
    "It is illegal for liquor stores to sell food or grocery stores to sell any alcohol except beer that is at most 3.",
    "No liquor may be sold on Sundays or election days. Repealed 2008: Colorado residents can now buy alcohol on Sundays",
    "It is illegal to ride a horse while under the influence.",
    "Tags may be ripped off of pillows and mattresses.",
    "Throwing missles at cars is illegal.",
    "Keeping a house where unmarried persons are allowed to have sex is prohibited.",
    "To own a dog over three months of age, one must obtain a license.",
    "Persons may not urinate in public.",
    "Establishments which sell alcohol must have enough lighting to read text inside them.",
    "Catapults may not be fired at buildings.",
    "It is legal to challenge a police officer, but only until he or she asks you to stop.",
    "It is illegal to permit ones llama to graze on city property.",
    "Boulders may not be rolled on city property.",
    "Couches may not be placed on outside porches.",
    "It is permissable to wear a holstered six-gun within city limits, except on Sunday, Election Day, or holidays.",
    "It is illegal to bring your horse or pack mule above the ground floor of any building.",
    "The dog catcher must notify dogs of impounding by posting, for three consecutive days, a notice on a tree in the city park and along a public road running through said park.",
    "It is unlawful to lend your vacuum cleaner to your next-door neighbor."
  ]
},{
  "Connecticut": [
    "Town records may not be kept where liquor is sold.",
    "You can be stopped by the police for biking over 65 miles per hour.",
    "In order for a pickle to officially be considered a pickle, it must bounce.",
    "It is illegal to dispose of used razor blades.",
    "REPEALED You cannot buy any alcohol after 9pm or on Sundays after noon on Sunday.",
    "It is illegal to discharge a firearm from a public highway.",
    "It is unlawful to walk backwards after sunset.",
    "Only white Christmas lights are allowed for display.",
    "You aren’t allowed to cross a street while walking on your hands.",
    "You may not educate dogs.",
    "It is illegal for a man to kiss his wife on Sunday.",
    "The use of a bean whistle in public is prohibited.",
    "It is illegal for fire trucks to exceed 25mph, even when going to a fire.",
    "An arcade may not have more than a total of four amusement devices such as ping-pong tables, pinball machines, or shuffleboard tables.",
    "Silly string is banned.",
    "It is illegal for any beautician to hum, whistle, or sing while working on a customer."
  ]
},{
  "Delaware": [
    "“R” rated movies shall not be shown at drive-in theaters.",
    "It is illegal to fly over any body of water, unless one is carrying sufficient supplies of food and drink.",
    "One may not lay down on the beach at night",
    "Persons may not change clothes in their car",
    "It is illegal to have a picnic on a highway",
    "It is illegal to wear pants that are “firm fitting” around the waist.",
    "Getting married on a dare is grounds for an annulment.",
    "No person shall change clothes in his or her vehicle.",
    "On Halloween, children may only “trick-or-treat” from 6:00 PM to 8:00 PM, and if Halloween falls on a Sunday, they must “trick-or-treat” on October 30 during this same time interval.",
    "One may not whisper in church.",
    "No person shall pretend to sleep on a bench on the boardwalk.",
    "Changing into or out of a bathing suit in a public restroom is prohibited.",
    "Six-year-old girls may not run around without being fully clothed.",
    "Alcohol may not be served in nightclubs if dancing is occurring on the premises at the same time.",
    "All persons must carry a bag with them at all times when they walk their dog in case said dog “poops”, or risk a $100 fine."
  ]
},{
  "Florida": [
    "Florida (accidentally) banned all computers and smart phones in internet cafes",
    "The term “motor vehicle” was revised to exclude swamp buggies, deregulating the primary mode of transportation in the state.",
    "Repealed It is illegal for a doctor to ask a patient whether they own a gun.",
    "The state constitution allows for freedom of speech, a trial by jury, and pregnant pigs to not be confined in cages.",
    "One may not commit any “unnatural acts” with another person.",
    "Unmarried couples may not commit “lewd acts” and live together in the same residence.",
    "Corrupting the public morals is defined as a nuisance, and is declared a misdemeanor offense.",
    "Doors of all public buildings must open outwards.",
    "It is illegal to sell your children.",
    "Women may be fined for falling asleep under a hair dryer, as can the salon owner.",
    "Oral sex is illegal.",
    "A special law prohibits unmarried women from parachuting on Sunday or she shall risk arrest, fine, and/or jailing.",
    "You may not kiss your wife’s breasts.",
    "If an elephant is left tied to a parking meter, the parking fee has to be paid just as it would for a vehicle.",
    "Penalty for horse theft is death by hanging.",
    "It is illegal to sing in a public place while attired in a swimsuit.",
    "Men may not be seen publicly in any kind of strapless gown.",
    "Having sexual relations with a porcupine is illegal.",
    "It is illegal to skateboard without a license.",
    "When having sex, only the missionary position is legal."
  ]
},{
  "Georgia": [
    "You cannot live on a boat for more than 30 days during the calendar year, even if just passing through the state",
    "If an organization non registered as “non-profit” fails to register their raffle with the local sheriff, that group risks paying up to $10,000 in fines and spending five years in jail.",
    "While Georgia operates its own lottery, it “protects” its citizens by making it illegal to promote a private lottery.",
    "The term “sadomasochistic abuse” is defined so broadly, that it could possibly be applied to a person handcuffing another in a clown suit.",
    "All sex toys are banned.",
    "It is illegal to use profanity in front of a dead body which lies in a funeral home or in a coroners office.",
    "Members of the state assembly cannot be ticketed for speeding while the state assembly is in session.",
    "Donkeys may not be kept in bathtubs.",
    "Signs are required to be written in English.",
    "No one may carry an ice cream cone in their back pocket if it is Sunday.",
    "All citizens must own a rake.",
    "Adult bookstores may not sell alcohol.",
    "If you want to read your favorite book in public to your friends, do it before 2:45 AM.",
    "Massage businesses may not sell alcohol on the side.",
    "It is illegal to sell two beers are once for a single price. For example, a bar can’t run a 2 Bud Lights for $5 special.",
    "Though being forced to close your business is bad enough, Athens-Clarke County forces one to obtain a license before holding a Going-Out-Of-Business sale.",
    "Goldfish may not be given away to entice someone to enter a game of bingo.",
    "Owners of mules may not allow their animal to roam around Athens unsupervised.",
    "Persons under the age of 16 may not play pinball after 11:00 PM.",
    "It is illegal for one to make a disturbing sound at a fair."
  ]
},{
  "Hawaii": [
    "In Hawaii you will be fined for riding in the back of a passenger car without a seatbelt, however you can ride in the bed of a pickup truck with no safety equipment",
    "You may only have one alcoholic drink in front of you at a time",
    "Billboards are outlawed.",
    "All residents may be fined as a result of not owning a boat.",
    "Coins are not allowed to be placed in one’s ears."
  ]
},{
  "Idaho": [
    "Illegal for a man to give his sweetheart a box of candy weighing less than fifty pounds.",
    "You may not fish on a camel’s back.",
    "Riding a merry-go-round on Sundays is considered a crime.",
    "Residents may not fish from a giraffe’s back.",
    "If a police officer approaches a vehicle and suspects that the occupants are engaging in sex, he must either honk, or flash his lights and wait for three minutes before approaching the car.",
    "Dirt may not be swept from one?s house into the street.",
    "Bicycles are not allowed in the tennis courts.",
    "Persons may not camp out on sidewalks in the city.",
    "A law passed in 1912 provided that “The carrying of concealed weapons is forbidden, unless some are exhibited to public view.",
    "A person may not be seen in public without a smile on their face."
  ]
},{
  "Illinois": [
    "It is against the law to have sex with a corpse in Illinois",
    "Sex offenders in Illinois are prohibited from participating in holiday events like handing out candy at Halloween and Easter or dressing like Santa at Christmas, except under specific circumstances",
    "Those under 21 can drink legally, but they must be enrolled in a culinary program to do so",
    "It is illegal to hang “obstructions” form the rear view mirror, including fuzzy dice, air fresheners, GPS units, etc.",
    "You may be arrested for vagrancy if you do not have at least one dollar bill on your person.",
    "You must contact the police before entering the city in an automobile.",
    "The English language is not to be spoken.",
    "No one may stand on the sidewalk on the 500 block of Illinois Avenue. (Retracted)",
    "One may not pee in his neighbor’s mouth.",
    "Citizens can be hit with a $120 ticket for having an improperly displayed and outdated city sticker on their car.",
    "All businesses entering into contracts with the city must sift through their records and report any business they had dealing with slaves during the era of slavery.",
    "Law forbids eating in a place that is on fire.",
    "It is illegal to give a dog whiskey.",
    "It is forbidden to fish while sitting on a giraffe’s neck.",
    "Kites may not be flown within the city limits.",
    "",
    "In the Pullman area, it is illegal to drink beer out of a bucket while sitting on the curb.",
    "It is legal to protest naked in front of city hall as long as you are under seventeen years of age and have legal permits.",
    "Humming on public streets is prohibited on Sundays.",
    "It is illegal to wear sagging pants in Collinsville, IL."
  ]
},{
  "Indiana": [
    "Waitresses may not carry drinks into a restaurant or bar.",
    "Hotel sheets must be exactly 99 inches long and 81 inches wide.",
    "If any person has a puppet show, wire dancing or tumbling act in the state of Indiana and receives money for it, they will be fined $3 under the Act to Prevent Certain Immoral Practices.",
    "Anyone 14 or older who profanely curses, damns or swears by the name of God, Jesus Christ or the Holy Ghost, shall be fined one to three dollars for each offense, with a maximum fine of ten dollars per day.",
    "A three dollar fine per pack will be imposed on anyone playing cards in Indiana under the Act for the Prevention of Gaming.",
    "The value of Pi is 3.",
    "It is illegal for a man to be sexually aroused in public.",
    "One may not sniff glue.",
    "One man may not back into a parking spot becasue it prevents police officers from seeing the license plate.",
    "State government officials who engage in private duels can be dismissed from their post.",
    "A person must get a referral from a licensed physician if he or she wishes to see a hypnotist unless the desired procedure is to quit smoking or lose weight.",
    "Smoking in the state legislature building is banned, except when the legislature is in session.",
    "All males 18 to 50 years old must work six days a year on public roads.",
    "Baths may not be taken between the months of October and March.",
    "Check forgery can be punished with public flogging up to 100 stripes.",
    "Mustaches are illegal if the bearer has a tendency to habitually kiss other humans.",
    "It is illegal to sell cars on Sunday.",
    "Pedestrians crossing the highway at night are prohibited from wearing tail lights.",
    "Oral sex is illegal.",
    "No one may catch a fish with his bare hands."
  ]
},{
  "Iowa": [
    "It is a crime to use a dead person’s handicapped parking sign or license plate",
    "A man with a moustache may never kiss a woman in public.",
    "One-armed piano players must perform for free.",
    "Kisses may last for no more than five minutes.",
    "It is a violation of the law to sell or distribute drugs or narcotics without having first obtained the appropriate Iowa drug tax stamp.",
    "Tanning bed facilities must warn of the risk of getting a sunburn.",
    "A board was created to regulate among other things, hearing aids.",
    "Ministers must obtain a permit to carry their liquor across state lines.",
    "Doctors who treat a person with gonorrhea must report this to the local board of health and include the disease’s “probable origin”.",
    "All boxes used to pick hops must be exactly 36 inches long.",
    "Liquor stores may not place advertisements for beer outside the store.",
    "It is illegal to read persons? palms in the city limits.",
    "Any hotel in the city limits must have a water bucket and a hitching post in front of the building.",
    "The fire department is required to practice fire fighting for fifteen minutes before attending a fire.",
    "The “Ice Cream Man” and his truck are banned.",
    "Horses are forbidden to eat fire hydrants.",
    "One must obtain written permission from the City Council before throwing bricks into a highway.",
    "No person may pick a flower from a city park.",
    "All softball diamond lights must be turned off by 10:30 PM.",
    "Within the city limits, a man may not wink at any woman he does not know."
  ]
},{
  "Kansas": [
    "Rabbits may not be shot from motorboats.",
    "Pedestrians crossing the highways at night must wear tail lights.",
    "No one may catch fish with his bare hands.",
    "The state game rule prohibits the use of mules to hunt ducks.",
    "If two trains meet on the same track, neither shall proceed until the other has passed.",
    "It is illegal to urinate on the side of a building.",
    "Hitting a vending machine that stole your money is illegal.",
    "Persons may not “screech” their tires while driving.",
    "Riding an animal down any road is against the law.",
    "It is illegal to spit on a sidewalk.",
    "",
    "All cars entering the city limits must first sound their horn to warn the horses of their arrival.",
    "No one may wear a bee in their hat.",
    "One may not picket a funeral.",
    "Musical car horns are banned.",
    "It is against the law to leave your car running unattended.",
    "It is illegal to drive oneâ??s car through a parade.",
    "Many cities have laws to force citizens to keep their yards in decent shape.",
    "No one may sing the alphabet on the streets at night.",
    "Spitting on sidewalks is expressing forbidden."
  ]
},{
  "Kentucky": [
    "Throwing eggs at a public speaker could result in up to one year in prison. (Repealed, 1975)",
    "One may not dye a duckling blue and offer it for sale unless more than six are for sale at once.",
    "It is illegal to fish with a bow and arrow in Kentucky.",
    "Dogs may not molest cars.",
    "One may not receive anal sex.",
    "A woman may not buy a hat without her husband’s permission."
  ]
},{
  "Louisiana": [
    "“Fake” wrestling matches are prohibited.",
    "Spectators at a boxing match may not mock one of the contestants.",
    "One could possibly land in jail for 20 years upon urinating in the city’s water supply.",
    "A law was passed with the specific intent of stating the punishment for stealing crawfish.",
    "Persons could land in jail for up to ten years for stealing an alligator.",
    "It is a $500 fine to instruct a pizza delivery man to deliver a pizza to your friend without them knowing.",
    "Running an abortion advertisement can land you in jail for a year.",
    "It is illegal to rob a bank and then shoot at the bank teller with a water pistol.",
    "Biting someone with your natural teeth is “simple assault,” while biting someone with your false teeth is “aggravated assault.",
    "It is illegal to gargle in public places.",
    "It is illegal to shoot lasers at police officers.",
    "One may not “dare” another to go onto railroad tracks owned by another.",
    "Stealing an alligator could land a person in jail for up to ten years.",
    "It is illegal to steal a “movable” even if it classified as an “immovable”.",
    "Rituals that involve the ingestion of blood, urine, or fecal matter are not allowed.",
    "One could land in jail for up to a year for making a false promise.",
    "Every time a person is seriously burned, he must report the injury to the fire marshal.",
    "Prisoners who hurt themselves could serve an additional two years in jail.",
    "Minors may not go to businesses with coin-operated foosball machines unless accompanied by an adult.",
    "No one may pour a drink out on the ground at any drive-in movie."
  ]
},{
  "Maine": [
    "Shotguns are required to be taken to church in the event of a Native American attack.",
    "You may not step out of a plane in flight.",
    "After January 14th you will be charged a fine for having your Christmas decorations still up.",
    "To stroll down the street playing a violin is against the law.",
    "It is illegal to gamble at the airport.",
    "No person may roller skate on a sidewalk.",
    "If any part of the sign ordinances of the city are more stringent than federal laws, even though they may be in conflict with them, they will prevail.",
    "Mercury thermometers may not be sold in the city.",
    "It is illegal to expectorate from any second-story window.",
    "It is illegal to park in front of Dunkin Donuts.",
    "Dog leashes may not be over eight feet in length.",
    "Deer may not be fed.",
    "Advertisements may not be placed in cemeteries."
  ]
},{
  "Maryland": [
    "Oral sex can not be given or received anywhere.",
    "Thistles may not grow in one’s yard.",
    "It’s illegal to throw bales of hay from a second-story window within the city limits.",
    "It’s illegal to take a lion to the movies.",
    "It is a park rule violation to be in a public park with a sleeveless shirt.",
    "No person who is a “tramp” or “vagrant” shall loiter in any park at any time.",
    "It is a violation of city code to sell chicks or ducklings to a minor within 1 week of the Easter holiday.",
    "Though you may spit on a city roadway, spitting on city sidewalks is prohibited.",
    "You may not curse inside the city limits.",
    "It is illegal to use profane language on a playground.",
    "Knocking stones into a public park is prohibited.",
    "Persons may not swear while on the highway.",
    "It is illegal to remove a public building by writing on it.",
    "Citizens may not swim in the public fountains within the city limits."
  ]
},{
  "Massachusetts": [
    "It is illegal to give beer to hospital patients.",
    "Candy may not contain more than 1% of alcohol.",
    "Shooting ranges may not set up targets that resemble human beings.",
    "At a wake, mourners may eat no more than three sandwiches.",
    "Tomatoes may not be used in the production of clam chowder.",
    "Snoring is prohibited unless all bedroom windows are closed and securely locked.",
    "Quakers and witches are banned.",
    "An old ordinance declares goatees illegal unless you first pay a special license fee for the privilege of wearing one in public.",
    "Bullets may not be used as currency.",
    "Taxi drivers are prohibited from making love in the front seat of their taxi during their shifts.",
    "Massachusetts liquor stores can only open on Sundays if they are in Berkshire, Essex, Franklin, Middlesex or Worcester counties and are within 10 miles of the Vermont or New Hampshire borders.",
    "All men must carry a rifle to church on Sunday.",
    "Alcoholic drink specials are illegal.",
    "Hunting on Sundays is prohibited.",
    "Public boxing matches are outlawed.",
    "It is illegal to go to bed without first having a full bath.",
    "A woman can not be on top in sexual activities.",
    "No gorilla is allowed in the back seat of any car.",
    "Tattooing and body piercing is illegal. (Repealed in 2000)",
    "Children may smoke, but they may not purchase cigarettes."
  ]
},{
  "Michigan": [
    "Persons may not be drunk on trains.",
    "It is illegal to kill a dog using a decompression chamber.",
    "Adultery is illegal, but can only be punished upon a complaint by the affected husband or wife.",
    "No man may seduce and corrupt an unmarried girl, or else he risks five years in prison.",
    "The last Sunday in June of every year was named ?log cabin day?.",
    "Cars may not be sold on Sunday.",
    "A woman isn’t allowed to cut her own hair without her husband’s permission.",
    "There is a 3 cent bounty for each starling and 10 cent bounty for each crow killed in any village, township, or city in the state. (Repealed, 2006)",
    "It is legal for a robber to file a law suit, if he or she got hurt in your house.",
    "You may not swear in front of women and children. (Repealed, 2002)",
    "Any person over the age of 12 may have a license for a handgun as long as he/she has not been convicted of a felony.",
    "There is a law that makes it legal for a farmer to sleep with his pigs, cows, horses, goats, and chickens.",
    "Apparently the good folks in Detroit did not quite know what â??newâ?? meant.",
    "Putt-putt golf courses must close by 1:00 AM.",
    "Security guards at Joe Louis Arena will confiscate any item they feel might be thrown onto the ice.",
    "Couples are banned from making love in an automobile unless the act takes place while the vehicle is parked on the couple’s own property.",
    "Willfully destroying your old radio is prohibited.",
    "It is illegal for a man to scowl at his wife on Sunday.",
    "It is illegal to let your pig run free in Detroit unless it has a ring in its nose.",
    "No person shall throw an abandoned hoop skirt into any street or on any sidewalk, under penalty of a five- dollar fine for each offense."
  ]
},{
  "Minnesota": [
    "The land of 10,000 lakes declares mosquitos a public nuisance.",
    "It is illegal to stand around any building without a good reason to be there.",
    "A person may not cross state lines with a duck atop his head.",
    "It is illegal to sleep naked.",
    "All men driving motorcycles must wear shirts.",
    "Citizens may not enter Wisconsin with a chicken on their head.",
    "Oral sex is prohibited.",
    "All bathtubs must not have feet.",
    "Airplanes may not be landed in city parks.",
    "Residents of even numbered addresses may not water their plants on odd-numbered days excluding the thirty first day where it applies.",
    "It shall be the duty of any policeman or any other officer to enforce the provisions of this Section, and if any cat is found running at large, or which is found in any street, alley or public place, it shall be the duty of any policeman or other officer of the city to kill such cat.",
    "People are forbidden from walking in and/or down alleyways.",
    "Red cars may not drive down Lake Street.",
    "Driving a truck with dirty tires is considered a public nuisance.",
    "Placing tacks on a sidewalk is considered a public nuisance.",
    "Any person who persuades another to enter a massage therapist business after 11:00 PM is guilty of a misdemeanor.",
    "Hamburgers may not be eaten on Sundays."
  ]
},{
  "Mississippi": [
    "Mississippi’s “Anti-Bloomberg Bill” will restrict towns and counties from regulating nutrition labeling",
    "If one is a parent to two illegitimate children, that person will go to jail for at least one month.",
    "No one may bribe any athlete to “rig” a game, match, tournament, etc.",
    "It is illegal to teach others what polygamy is.",
    "A man may not seduce a woman by lying, and claiming he will marry her.",
    "One may be fined up to $100 for using “profane language” in public places.",
    "Private citizens may personally arrest any person that disturbs a church service.",
    "It is illegal for a male to be sexually aroused in public.",
    "Cattle rustling is punishable by hanging.",
    "Horses are not to be housed within 50 feet of any road.",
    "Adultery or Fornication (living togeather while not married or having sex with someone that is not your spouse) results in a fine of $500 and/or 6 months in prison.",
    "Vagrancy is punishable by either 30 days in prison or a $250 fine.",
    "Unnatural intercourse, if both parties voluntarily participate, results in a maximum sentence of 10 years and $10,000.",
    "It is unlawful for anyone to have sex in public.",
    "Exterior burglar bars which are viewable from the street are not allowed.",
    "It is unlawful to shave in the center of main street."
  ]
},{
  "Missouri": [
    "It is illegal to have oral sex.",
    "Single men between the ages of twenty-one and fifty must pay an annual tax of one dollar (enacted 1820).",
    "It is illegal to speed",
    "In this small town of only 4,000, yard waste may be burned any day except Sunday.",
    "You can not have a antenna exposed outside of your house yet you can have a 25′ satellite dish.",
    "Though clotheslines are banned, clothes may be draped over a fence.",
    "One may not drink in a bar between 2:00 and 6:00 AM.",
    "Minors are not allowed to purchase cap pistols, however they may buy shotguns freely.",
    "Installation of bathtubs with four legs resembling animal paws is prohibited.",
    "Minors can buy rolling paper and tobacco but not lighters.",
    "It is illegal for more than four unrelated persons to occupy the same dwelling (The Brothel Law).",
    "Frightening a baby is in violation of the law.",
    "It shall be unlawful to provide beer or other intoxicants to elephants.",
    "",
    "Dancing is strictly prohibited.",
    "It’s illegal to sit on the curb of any city street and drink beer from a bucket.",
    "A milk man may not run while on duty.",
    "Four women may not rent an apartment together.",
    "No person may own a PVC pipe.",
    "No person may have a “yard sale” in their front yard."
  ]
},{
  "Montana": [
    "Prostitution is considered a “crime against the family”.",
    "One may not pretend to abuse an animal in the presence of a minor.",
    "In Montana, it is illegal for married women to go fishing alone on Sundays, and illegal for unmarried women to fish alone at all.",
    "It is illegal for a man and a woman to have sex in any other position other than missionary style.",
    "Seven or more indians are considered a raiding or war party and it is legal to shoot them.",
    "It is illegal to have a sheep in the cab of your truck without a chaperone.",
    "It is a felony for a wife to open her husband’s mail.",
    "It is a misdemeanor to show movies that depict acts of felonious crime.",
    "No person shall raise pet rats.",
    "Persons in possession of a “pea shooter” risk it being conviscated by police.",
    "It is illegal to bring a bomb or rocket at city council proceedings.",
    "Bands who play in clubs where alcohol is served may not leave the stage while performing.",
    "It is illegal to use speed-dial in the city phone system.",
    "Hard objects may not be thrown by hand.",
    "Worrying squirrels will not be tolerated.",
    "Balls may not be thrown within the city limits.",
    "It is illegal to annoy passersby on sidewalks with a revolving water sprinkler.",
    "The game of “folf” may not be played at night.",
    "No item may be thrown across a street.",
    "All pool tables must be able to be viewed from the street outside a billiard hall where they are located."
  ]
},{
  "Nebraska": [
    "Drivers on mountains should drive with caution near the right hand edge of the highway –there are no mountains in Nebraska!",
    "Persons with gonorrhea may not marry.",
    "It is illegal to fly a plane while drunk.",
    "If a child burps during church, his parent may be arrested.",
    "It is Illegal to go whale fishing.",
    "It is illegal for bar owners to sell beer unless they are simultaneously brewing a kettle of soup.",
    "It is illegal for a mother to give her daughter a perm without a state license.",
    "Doughnut holes may not be sold.",
    "Sneezing or burping is illegal during a church service.",
    "A man is not allowed to run around with a shaved chest.",
    "Barbers are forbidden from eating onions between 7 A."
  ]
},{
  "Nevada": [
    "It is illegal to drive a camel on the highway.",
    "It’s still “legal” to hang someone for shooting your dog on your property.",
    "An ordinance makes bringing a concealable fire arm into the county illegal unless it is registered with the Las Vegas Metropolitan Police Department.",
    "Everyone walking the streets is required to wear a mask.",
    "A man is forbidden from buying drinks for more than three people other than himself at any one period during the day.",
    "It is illegal to lie down on the sidewalk.",
    "Benches may not be placed in the middle of any street.",
    "Sex toys are outlawed."
  ]
},{
  "New Hampshire": [
    "You may not tap your feet, nod your head, or in any way keep time to the music in a tavern, restaurant, or cafe.",
    "You cannot sell the clothes you are wearing to pay off a gambling debt.",
    "It is considered an offense to check into a hotel under an assumed name.",
    "It is illegal to pick seaweed up off of the beach.",
    "Any cattle that crosses state roads must be fitted with a device to gather its feces.",
    "You may not run machinery on Sundays.",
    "On Sundays citizens may not relieve themselves while looking up.",
    "In cemeteries it is illegal to: get drunk, picnic, enter at night, and enter by one’s self if that person is younger than 10.",
    "If a person is caught raking the beaches, picking up litter, hauling away trash, building a bench for the park, or many other kind things without a permit, he/she may be fined $150 for ”maintaining the national forest without a permit”."
  ]
},{
  "New Jersey": [
    "Drivers must warn those who they pass on highways before they do so.",
    "Spray paint may not be sold without a posted sign warning juveliles of the penalty for creating graffiti.",
    "Handcuffs may not be sold to minors.",
    "All motorists must honk before passing another car, bicyclist, skater, and even a skateboarder.",
    "It is illegal to wear a bullet-proof vest while committing a murder.",
    "One must yield a phone line to a person if it is an emergency.",
    "You cannot pump your own gas.",
    "It is against the law for a man to knit during the fishing season.",
    "It is against the law to “frown” at a police officer.",
    "In an attempt to “foster kindness” in the citizens of New Jersey, the month of May is designated “Kindness Awareness Month”.",
    "If you have been convicted of driving while intoxicated, you may never again apply for personalized license plates.",
    "The third Thursday of October is designated as “New Jersey Credit Union Day” and citizens of the state should observe the day with “appropriate activities and programs”.",
    "Car dealerships are forbidden from opening on Sunday.",
    "You may not slurp your soup.",
    "Automobiles are not to pass horse drawn carriages on the street.",
    "It is illegal to delay or detain a homing pigeon.",
    "It is illegal to frown as the town is a “Frown-Free Town Zone”.",
    "Shooting ranges are outlawed.",
    "No street-side trees may be planted that “obscure the air”.",
    "It is illegal to throw ashes on the sidewalk."
  ]
},{
  "New Mexico": [
    "Nudity is allow, provided that male genitals are covered.",
    "Women may walk in public topless provided they have their nipples covered.",
    "Idiots may not vote.",
    "State officials ordered 400 words of “sexually explicit material” to be cut from Romeo and Juliet.",
    "Women may walk in public topless provided they have their nipples covered.",
    "It’s forbidden for a female to appear unshaven in public.",
    "Persons may not spit on the steps of the opera house.",
    "Hunting is prohibited in Mountain View Cemetery.",
    "",
    "You may not carry a lunchbox down Main Street."
  ]
},{
  "New York": [
    "It is illegal to congregate in public with two or more people while each wearing a mask or any face covering which disguises your identity.",
    "In New York, adultery is still a crime.",
    "It is against the law to throw a ball at someone’s head for fun.",
    "The penalty for jumping off a building is death.",
    "New Yorkers cannot dissolve a marriage for irreconcilable differences, unless they both agree to it.",
    "A person may not walk around on Sundays with an ice cream cone in his/her pocket.",
    "Women may go topless in public, providing it is not being used as a business.",
    "While riding in an elevator, one must talk to no one, and fold his hands while looking toward the door.",
    "You may not smoke within 100 feet of the entrance to a public building.",
    "Slippers are not to be worn after 10:00 PM.",
    "It is illegal for a woman to be on the street wearing “body hugging clothing”.",
    "Citizens may not greet each other by “putting one’s thumb to the nose and wiggling the fingers”.",
    "A fine of $25 can be levied for flirting.",
    "During a concert, it is illegal to eat peanuts and walk backwards on the sidewalks.",
    "It is against town ordinances to camp out on your own land more than 72 hours a month. If you want to camp out for 2 weeks you need a permit, which can only be obtained once a year.",
    "A law from the early 1900’s prohibits men from going topless on the Boardwalk.",
    "Eating while swimming in the ocean is prohibited.",
    "People may not slurp their soup.",
    "Pinball machines are not to be played on Sunday.",
    "Raw hamburger may not be sold."
  ]
},{
  "North Carolina": [
    "It is a felony to steal more than $1000 of grease",
    "A bill has been passed that restricts local planning agencies’ ability to use climate change science to predict sea-level rise.",
    "The mere possession of a lottery ticket is illegal in North Carolina and may result in a $2,000 fine. Repealed",
    "No one may be a professional fortune-teller, and if one wishes to pursue the practice as an amateur, it must be practiced in a school or church. Repealed by Session Laws 2004-003",
    "Oral sex is considered a crime against nature.",
    "A marriage can be declared void if either of the two persons is physically impotent.",
    "It’s against the law to sing off key.",
    "Elephants may not be used to plow cotton fields.",
    "While having sex, you must stay in the missionary position and have the shades pulled.",
    "If a man and a woman who aren’t married go to a hotel/motel and register themselves as married then, according to state law, they are legally married.",
    "All couples staying overnight in a hotel must have a room with double beds that are at least two feet apart.",
    "It is illegal to have sex in a churchyard.",
    "Persons in possession of illegal substances must pay taxes on them.",
    "A three dollar tax must be paid on all white goods sold.",
    "Organizations may not hold their meetings while the members present are in costume.",
    "Bingo games may not last over 5 hours unless it is held at a fair.",
    "Serving alcohol at a bingo game is not allowed.",
    "Fights between cats and dogs are prohibited.",
    "It is a misdemeanor to urinate or defecate publicly.",
    "Women must have their bodies covered by at least 16 yards of cloth at all times."
  ]
},{
  "North Dakota": [
    "It is illegal to lie down and fall asleep with your shoes on.",
    "Beer and pretzels can’t be served at the same time in any bar or restaurant.",
    "It is legal to shoot an Indian on horseback, provided you are in a covered wagon.",
    "New Year’s celebrations are somewhat bland in this town as fireworks may not be set off after 11:00 PM!",
    "One may be jailed for wearing a hat while dancing, or even for wearing a hat to a function where dancing is taking place."
  ]
},{
  "Ohio": [
    "",
    "It is illegal for more than five women to live in a house.",
    "It is illegal to mistreat anything of great importance.",
    "No civil arrests may be made on Sunday or on the Fourth of July",
    "In Ohio, if you ignore an orator on Decoration day to such an extent as to publicly play croquet or pitch horseshoes within one mile of the speaker’s stand, you can be fined $25.",
    "Women are prohibited from wearing patent leather shoes in public.",
    "It is illegal to fish for whales on Sunday.",
    "It is illegal to get a fish drunk.",
    "The Ohio driver’s education manual states that you must honk the horn whenever you pass another car.",
    "Participating or conducting a duel is prohibited.",
    "Breast feeding is not allowed in public.\n(Revised 2005)\n\n",
    "It is illegal to display colored chickens for sale.",
    "No person shall solicit sex from another of the same gender if it offends the second person.",
    "Skateboarding in the city limits after dark is prohibited.",
    "Posting signs at swimming pools is illegal.",
    "It is illegal to walk a cow down Lake Road.",
    "Ordinance number 223, of 09/09/19 prohibits the installation and usage of slot machines in outhouses.",
    "Electric fences are banned.",
    "If one loses their pet tiger, they must notify the authorities within one hour.",
    "Power Wheels® cars may not be driven down the street."
  ]
},{
  "Oklahoma": [
    "One may not promote a “horse tripping event”.",
    "It is illegal for the owner of a bar to allow anyone inside to pretend to have sex with a buffalo.",
    "Females are forbidden from doing their own hair without being licensed by the state.",
    "It’s statutory rape for a man over 18 to have sex with a female under the age of 18, provided she’s a virgin.",
    "Dogs must have a permit signed by the mayor in order to congregate in groups of three or more on private property.",
    "Tattoos are banned. (Repealed, Effective 11/1/2006. Tattoos are now legal in Oklahoma!)",
    "Oklahoma will not tolerate anyone taking a bite out of another’s hamburger.",
    "No one may spit on a sidewalk.",
    "It is against the law to read a comic book while operating a motor vehicle.",
    "It is illegal to wear your boots to bed.",
    "Whaling is illegal.",
    "It is illegal to have sex before you are married.",
    "It is illegal to have the hind legs of farm animals in your boots.",
    "Fish may not be contained in fishbowls while on a public bus.",
    "Residents are taxed for the furniture in their homes, and any other personal belongings.",
    "Tissues are not to be found in the back of one’s car.",
    "People who make “ugly faces” at dogs may be fined and/or jailed.",
    "Cars must be tethered outside of public buildings.",
    "Oral sex is a misdemeanor and is punisable by one year in jail and a $2,500 fine.",
    "Anyone arrested for soliciting a hooker must have their name and picture shown on television."
  ]
},{
  "Oregon": [
    "Drivers must yield to pedestrians who are standing on the sidewalk.",
    "One may not test their physical endurance while driving a car on a highway.",
    "It is illegal to place a container filled with human fecal matter on the side of any highway.",
    "Babies may not be carried on the running boards of a car.",
    "Drivers may not pump their own gas.",
    "A door on a car may not be left open longer than is necessary.",
    "An adult may not show a minor any piece of classical artwork which depicts sexual excitement.",
    "It is illegal to whisper “dirty” things in your lover’s ear during sex.",
    "Ice cream may not be eaten on Sundays.",
    "It is illegal to buy or sell marijuana, but it is legal to smoke it on your own property.",
    "One may not bathe without wearing “suitable clothing,” i.",
    "Canned corn is not to be used as bait for fishing.",
    "Dishes must drip dry.",
    "The “Peer Review Statute” prohibits you from finding out details of any written or oral discussion about your medical treatment.",
    "You must buy a $10 permit to be allowed to install a burglar alarm.",
    "It is illegal to show movies or attend a car race on Sundays.",
    "It is legal to conduct a horse race or a symphony concert.",
    "Juggling is strictly prohibited without a license.",
    "It’s illegal to walk down a sidewalk and knock a snakes head off with your cane.",
    "You cannot eat a doughnut and walk backwards on a city street."
  ]
},{
  "Pennsylvania": [
    "It is contrary to Pennsylvania law to discharge a gun, cannon, revolver or other explosive weapon at a wedding.",
    "All liquor stores must be run by the state.",
    "It is illegal to have over 16 women live in a house together because that constitutes a brothel.",
    "Motorized vehicles are not to be sold on Sundays.",
    "It it illegal to sleep on top of a refrigerator outdoors.",
    "You may not catch a fish with your hands.",
    "Any motorist driving along a country road at night must stop every mile and send up a rocket signal, wait 10 minutes for the road to be cleared of livestock, and continue.",
    "You may not catch a fish by any body part except the mouth.",
    "A special cleaning ordinance bans housewives from hiding dirt and dust under a rug in a dwelling.",
    "Dynamite is not to be used to catch fish.",
    "You may not sing in the bathtub.",
    "Though you do not need a fishing license to fish on your own land, but a hunting license is required to hunt on your own land.",
    "Fireworks stores may not sell fireworks to Pennsylvania residents.",
    "A person is not eligible to become Governor if he/she has participated in a duel.",
    "Any motorist who sights a team of horses coming toward him must pull well off the road, cover his car with a blanket or canvas that blends with the countryside, and let the horses pass.",
    "Ministers are forbidden from performing marriages when either the bride or groom is drunk.",
    "No more than two packages of beer at a time may be purchased, unless you are buying from an official “beer distributor”.",
    "There is a ban on men becoming aroused in public.",
    "Persons convicted of felonies may not operate Bingo games.",
    "Operators of bingo games may not advertise the prizes offered."
  ]
},{
  "Rhode Island": [
    "Cap guns are illegal.",
    "Ropes may not be strung across a highway.",
    "No one may bite off another?s leg.",
    "Any marriage where either of the parties is an idiot or lunatic is null and void.",
    "It is considered an offense to throw pickle juice on a trolley.",
    "Rhode Island recently applied to the US Government to make all the coastal waters of Rhode Island a “No Discharge Zone”.",
    "Impersonating a town sealer, auctioneer, corder of wood, or a fence-viewer is against the law.",
    "Riding a horse over any public highway for the purpose of racing, or testing the speed of the horse is illegal.",
    "Exercising any labor, business, or work, or using any game, sport, play, or recreation, or causing any of the above to be done to or by your children, servants, or apprentices on the first day of the week (Sunday) results in a penalty of $5 for the first offense and $10 for the second.",
    "Professional sports, except ice polo and hockey, must obtain a license to play games on Sunday.",
    "One must make a loud noise before passing a car on the left.",
    "You cannot smoke a pipe after sunset.",
    "There is not an appeals process for exemtion of property tax due to a disability or poverty.",
    "It is illegal to wear transparent clothing.",
    "You may not sell toothpaste and a toothbrush to the same customer on a Sunday.",
    "It is illegal to drive down any street with beer in your car, even if it is unopened.",
    "It is illegal to use water on even-numbered days for the sole purpose of watering plants, gardens, or lawns."
  ]
},{
  "South Carolina": [
    "An exception to the above law is that light bulbs may be sold.",
    "Every adult male must bring a rifle to church on Sunday in order to ward off Indian attacks.",
    "No work may be done on Sunday.",
    "It is a capital offense to inadvertently kill someone while attempting suicide.",
    "Musical instruments may not be sold on Sunday.",
    "A person must be eighteen years old to play a pinball machine.",
    "Performing a U-turn within 1,000 feet of an intersection is illegal.",
    "It is considered an offense to get a tattoo.",
    "It is illegal to display a confederate flag on a courthouse.",
    "Horses may not be kept in bathtubs.",
    "By law, if a man promises to marry an unmarried woman, the marriage must take place.",
    "It is illegal to sell any alcoholic beverages on Sunday, unless you own a private club.",
    "Railroad companies may be held liable in some instances for scaring horses.",
    "A permit must be obtained to fire a missle.",
    "A railroad my not remove itself from a town of more than five hundred people.",
    "It is illegal to give or receive oral sex in South Carolina.",
    "Fortune tellers are required to obtain a special permit from the state.",
    "When approaching a four way or blind intersection in a non-horse driven vehicle you must stop 100 ft from the intersection and discharge a firearm into the air to warn horse traffic.",
    "Dance halls may not operate on Sundays.",
    "It is perfectly legal to beat your wife on the court house steps on Sundays."
  ]
},{
  "South Dakota": [
    "No horses are allowed into Fountain Inn unless they are wearing pants.",
    "It is illegal to lie down and fall asleep in a cheese factory.",
    "Movies that show police officers being struck, beaten, or treated in an offensive manner are forbidden.",
    "If there are more than 5 Native Americans on your property you may shoot them.",
    "If three or more Indians are walking down the street together, they can be considered a war party and fired upon."
  ]
},{
  "Tennessee": [
    "Students may not hold hands while at school.",
    "It is a crime to share your Netflix password in Tennessee.",
    "In Tennessee it is illegal to to post images online that cause â??emotional distressâ? â??without legitimate purposeâ?.",
    "Ministers are to be dedicated to God and therefore are not eligible to hold a seat in either House of the Legislature.",
    "Any person who participates in a duel may not hold any public office in the state.",
    "Giving and receiving oral sex is still prohibited by law.",
    "Stealing a horse is punishible by hanging.",
    "No Christian parent may require their children to pick up trash from the highway on Easter day.",
    "It is legal to gather and consume roadkill.",
    "You can’t shoot any game other than whales from a moving automobile.",
    "Hollow logs may not be sold.",
    "More than 8 women may not live in the same house because that would constitute a brothel.",
    "It is illegal to use a lasso to catch a fish.",
    "“Crimes against nature” are prohibited.",
    "The definition of “dumb animal” includes every living creature.",
    "Interracial marriages are illegal.",
    "Tattooing a minor is a misdemeanor.",
    "It is illegal to dare a child to purchase a beer.",
    "It is illegal to place tacks on a highway.",
    "Skunks may not be carried into the state."
  ]
},{
  "Texas": [
    "The Bluebonnet is the official song of the state flower.",
    "It is illegal to sell one’s eye",
    "A program has been created in the state that attempts to control the weather.",
    "One must acknowledge a supreme being before being able to hold public office.",
    "It is illegal to milk another person’s cow.",
    "A recently passed anticrime law requires criminals to give their victims 24 hours notice, either orally or in writing, and to explain the nature of the crime to be committed.",
    "Homosexual behavior is a misdemeanor offense.",
    "The entire Encyclopedia Britannica is banned in Texas because it contains a formula for making beer at home.",
    "When two trains meet each other at a railroad crossing, each shall come to a full stop, and neither shall proceed until the other has gone.",
    "It is illegal to take more than three sips of beer at a time while standing.",
    "Up to a felony charge can be levied for promoting the use of, or owning more than six dildos.",
    "It is illegal for one to shoot a buffalo from the second story of a hotel.",
    "It is illegal to idle or loiter anyplace within the corporate limits of the city for the purpose of flirting or mashing.",
    "Wire cutters can not be carried in your pocket.",
    "Collegiate football is banned at Lamar University.",
    "It is against the law to throw confetti, rubber balls, feather dusters, whips or quirts (riding crop), and explosive firecrackers of any kind.",
    "It is illegal to dust any public building with a feather duster.",
    "It’s illegal to possess realistic dildos.",
    "Urinating on the streets is illegal.",
    "Appearing in public places wearing a “lewd dress” is prohibited."
  ]
},{
  "Utah": [
    "It’s legal for restaurants to serve wine with meals, but only if you ask for the wine list.",
    "It is considered an offense to hunt whales.",
    "No one may have sex in the back of an ambulance if it is responding to an emergency call.",
    "It is against the law to fish from horseback.",
    "It is illegal not to drink milk.",
    "It is illegal to detonate any nuclear weapon.",
    "Birds have the right of way on all highways.",
    "A husband is responsible for every criminal act committed by his wife while she is in his presence.",
    "You’re not allowed to sell beverages containing more than 3.",
    "It is a felony to persistently tread on the cracks between paving stones on the sidewalk of a state highway.",
    "Alcohol may not be sold during an emergency.",
    "Individuals may not possess beer in containers larger than two liters unless they are a retailer.",
    "Boxing matches that allow biting are not allowed.",
    "It is illegal to cause a catastrophe.",
    "You must have identification to enter a convienence store after dark.",
    "Women may not swear.",
    "Daylight must be visible between partners on a dance floor.",
    "Only animal services officials and policemen may molest animals",
    "Persons are only allowed to keep one cow on their property",
    "Throwing snowballs will result in a $50 fine."
  ]
},{
  "Vermont": [
    "Women must obtain written permission from their husbands to wear false teeth.",
    "At one time it was illegal to tie a giraffe to a telephone pole.",
    "",
    "It is illegal to deny the existence of God.",
    "All residents shall bathe every Saturday night."
  ]
},{
  "Virginia": [
    "Citizens must honk their horn while passing other cars.",
    "Children are not to go trick-or-treating on Halloween.",
    "It is illegal to tickle women.",
    "Not only is it illegal to have sex with the lights on, one may not have sex in any position other than missionary.",
    "There is a state law prohibiting “corrupt practices of bribery by any person other than candidates.",
    "You may not engage in business on Sundays, with the exception of almost every industry.",
    "If one is not married, it is illegal for him to have sexual relations.",
    "You may not have oral or anal sex.",
    "Police radar detectors are illegal.",
    "No animal may be hunted for on Sunday with the exception of raccoons, which may be hunted until 2:00 AM.",
    "No one may wash a mule on the sidewalk.",
    "A person of color may not be oustide or within the city limits after 7 pm. According to the town of Dayton, no such law exists.",
    "Any person who owns a pool risks a $2500 fine for not closing the gate to the pool when they get done swimming in it.",
    "A special license is required for persons wishing to sell such items as tableware and coins.",
    "Spitting on a sea gull is not tolerated.",
    "A man may face 60 days in jail for patting a woman’s derriere.",
    "Women must wear a corsette after sundown and be in the company of male chaperone.",
    "No person may keep a skunk as a pet.",
    "It is illegal to cuss about another.",
    "It is illegal to park a car on railroad tracks."
  ]
},{
  "Washington": [
    "The harassing of Bigfoot, Sasquatch or other undiscovered subspecies is a felony punishable by a fine and/or imprisonment.",
    "It is illegal to attach a vending machine to a utility pole without prior consent from the utility company.",
    "No person may walk about in public if he or she has the common cold.",
    "Destroying a beer cask or bottle of another is illegal.",
    "It is illegal to entice girls away from the Maple Lane School for girls.",
    "X-rays may not be used to fit shoes.",
    "All lollipops are banned.",
    "A law to reduce crime states: “It is mandatory for a motorist with criminal intentions to stop at the city limits and telephone the chief of police as he is entering the town.",
    "It is illegal to paint polka dots on the American flag.",
    "People may not buy a mattress on Sunday.",
    "All motor vehicles must be preceded by a man carrying a red flag (daytime) or a red lantern (nighttime) fifty feet in front of said vehicle.",
    "It is illegal to pretend that one’s parents are rich.",
    "You are not allowed to breastfeed in public. (Repealed, 2001)",
    "One may not spit on a bus.",
    "When two trains come to a crossing, neither shall go until the other has passed.",
    "You cannot buy meat of any kind on Sunday.",
    "Single-use plastic carry out bags are prohibited",
    "You may not shuck peanuts on the street – False, you can!",
    "It is illegal to display a hypnotized or allegedly hypnotized person in a store window.",
    "Dancing and drinking may not occur at the same establishment."
  ]
},{
  "West Virginia": [
    "Unmarried couple who live together and “lewdly associate” with one another may face up to a year in prison. (Repealed: 2010)",
    "Roadkill may be taken home for supper.",
    "When a railroad passes within 1 mile of a community of 100 or more people in it, they must build a station and stop there regularly to pick up and drop off passengers.",
    "Whistling underwater is prohibited.",
    "Any person who commits adultery shall be fined at least twenty dollars. (Repealed 2010)",
    "It is legal for a male to have sex with an animal as long as it does not exceed 40 lbs.",
    "A tax of 1 cent is levied for every 16 and 9 ounces of coke sold in a store.",
    "A person may be placed in jail for up to six months for making fun of someone who does not accept a challege. (Repealed 2010)",
    "It is illegal to snooze on a train.",
    "A person may not hold public office if he or she has ever participated in a duel.",
    "For each act of public swearing a person shall be fined one dollar.",
    "According to the state constitution, it is unlawful for anyone to own a red or a black flag (Repealed 2010)",
    "If you wear a hat inside a theater, you may be fined (Repealed 2010)",
    "One may not walk a lion, tiger or leopard, even on a leash.",
    "Firemen may not whistle or flirt at any woman passing a firehouse.",
    "It is legal to beat your wife so long as it is done in public on Sunday, on the courthouse steps.",
    "No member of the clergy is allowed to tell jokes or humorous stories from the pulpit during a church service."
  ]
},{
  "Wisconsin": [
    "State Law made it illegal to serve apple pie in public restaurants without cheese.",
    "The state definition of rape stated that it was a man having sex with a woman he knows not to be his wife.",
    "While all cheese making requires a license, Limburger cheese making requires a master cheese maker’s license.",
    "It is illegal to kiss on a train.",
    "It is illegal to cut a woman’s hair.",
    "Margarine may not be substituted for butter in restaurants unless it is requested by the customer.",
    "Butter substitutes are not allowed to be served in state prisons.",
    "The government may not prohibit manual flushed urinals.",
    "Whenever two trains meet at an intersection of said tracks, neither shall proceed until the other has.",
    "As people used to smuggle it in from Illinois, all yellow butter substitute is banned.",
    "Condoms were considered an obsene article and had to hidden behind the pharmacist’s counter.",
    "At one time, margarine was illegal.",
    "One may not camp in a wagon on any public highway or risk a fine of up to ten dollars.",
    "It is a class A misdemeanor to wave a burning torch around in the air.",
    "It is illegal to throw rocks at a railroad car.",
    "Livestock have the right-of-way on public roads.",
    "Tattooing is illegal unless it is done for medical purposes.",
    "It is unlawful for one to allow another to use the first person’s telephone in order to make prank phone calls.",
    "Screens are required on all windows from May 1 to October 1.",
    "You are not allowed to put litter into someone else’s trash receptacle without express permission."
  ]
},{
  "Wyoming": [
    "All new buildings that cost over $100,000 to build must have 1% of funds spent on artwork for the building.",
    "If one is drunk in a mine, he or she could land in jail for up to a year.",
    "Junk dealers may not make any business transactions with drunk persons.",
    "It is illegal to wear a hat that obstructs people’s view in a public theater or place of amusement.",
    "Using a firearm to fish is strictly forbidden.",
    "Any person who fails to close a fence is subject to a fine of up to seven hundred and fifty dollars.",
    "It is illegal for women to stand within five feet of a bar while drinking.",
    "You may not take a picture of a rabbit from January to April without an official permit.",
    "Skiing under the influence of alcohol is prohibited.",
    "It is illegal to spit on the steps of a school."
  ]
}]